backend/controllers/OrderController.php

SELECT * FROM `order` WHERE (`id`='6') AND (COALESCE(order.is_deleted, 0) = 0)
---
    public function actionInvoice($id)
    {
        /* @var $model Order */
        $model = Order::findOne($id);