backend/controllers/UserController.php

                    return RegistrationForm::findOne($id);
                }
            ],
            'edit-profile' => [
                'class' => UpdateAction::class,
                'modelClass' => RegistrationForm::class,
                'scenario' => RegistrationForm::SCENARIO_ADMIN_UPDATE,
                'findModel' => function () {
                    return RegistrationForm::findOne(Yii::$app->user->id);
                }
            ],
---
SELECT * FROM `user` WHERE (`id`='6') AND (COALESCE(`user`.is_deleted, 0) = 0)