backend/models/forms/ProductForm.php

UPDATE `product` SET `id`=1, `category_id`=1, `cover_image_id`=9, `quantity`=5, `updated_at`=1772557853 WHERE `id`=1
---
    public function save($runValidation = true, $attributeNames = null)
    {
        $transaction = Yii::$app->db->beginTransaction();

        if (!parent::save($runValidation, $attributeNames)) {

SELECT * FROM `product_image` WHERE (`product_id`='1') AND (COALESCE(product_image.is_deleted, 0) = 0)
---
    protected function saveProductImages()
    {
        $previousImageIds = ArrayHelper::map($this->productImages, 'id', 'image_id');