common/models/Product.php

SELECT * FROM `product_image` WHERE (`product_id`='1') AND (COALESCE(product_image.is_deleted, 0) = 0) ORDER BY `order`
---
    protected function getOrderedProductImages(): array
    {
        return $this->getProductImages()->orderBy(['order' => SORT_ASC])->all();