common/models/User.php

SELECT * FROM `user` WHERE ((`id`=1) AND (`status`=10)) AND (COALESCE(`user`.is_deleted, 0) = 0)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE ((`username`='uuuuu') OR (`email`='uuuuu')) AND (COALESCE(`user`.is_deleted, 0) = 0)
---
    public static function findByUsernameOrEmail($key, $onlyActive = false)
    {
        $query = static::find()->where(['OR', ['username' => $key], ['email' => $key]]);

        if(!$onlyActive) {
            return $query->one();