common/components/image/ImageBehavior.php

SELECT * FROM `image_thumb` WHERE ((`spec_key`='w120_h120_fs1') AND (`image_id`=7) AND (`storage_key`='local/thumbs/w120_h120_fs1/25842cfa1d6357dce8564226c6fca1f9_2533.png')) AND (COALESCE(image_thumb.is_deleted, 0) = 0)
---
    public function findThumb($spec)
    {
        $specObj = new ImageSpecification($spec, $this->getOriginalWidth(), $this->getOriginalHeight());

        return ImageThumb::findOne([
            'spec_key' => $specObj->getKey(),
            'image_id' => $this->owner->id,
            'storage_key' => $this->generateThumbStorageKey($specObj->getKey())
        ]);