backend/views/order/partials/_invoice.php

SELECT * FROM `order_item` WHERE (`order_id`=6) AND (COALESCE(order_item.is_deleted, 0) = 0)
---
        </thead>
        <tbody>

        <?php foreach ($model->orderItems as $key => $orderItem): ?>