backend/views/order/view.php

SELECT * FROM `user` WHERE `id`=7
---
$this->params['breadcrumbs'][] = ['label' => Yii::t('app', 'Orders'), 'url' => ['index']];
$this->params['breadcrumbs'][] = "#{$model->code}";

$user = User::findWithDeleted()->where(['id' => $model->user_id])->one();